{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report confirming the Google Site Verification meta tag has been added to frontend/index.html, mapped to test REQ-46 with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing each component's purpose, styles, and key functionality.",
  "frontend/index.css": "Global Tailwind CSS entry file defining CSS custom property tokens for light and dark themes including colors, radius, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the QuickRepair app including viewport meta, SEO description, and the Google Site Verification meta tag, mounting the React app at #root.",
  "frontend/src/App.tsx": "Root React component that composes Navbar, Hero, Services, AboutUs, ContactUs, Footer, and FloatingButtons into the full single-page layout.",
  "frontend/src/components/AboutUs.tsx": "About section displaying four feature cards (Verified Mechanics, 10 Min Guarantee, Cash on Delivery, No Hidden Charges) and a stats bar with customer and mechanic counts.",
  "frontend/src/components/BookingForm.tsx": "Empty file placeholder for the booking form component.",
  "frontend/src/components/BookingHistory.tsx": "Empty file placeholder for the booking history component.",
  "frontend/src/components/ContactUs.tsx": "Contact section with clickable cards for phone, email, working hours, and WhatsApp, plus a service areas grid listing six coverage locations.",
  "frontend/src/components/EmergencySOS.tsx": "Empty file placeholder for the Emergency SOS component.",
  "frontend/src/components/FloatingButtons.tsx": "Fixed floating action buttons at bottom-right providing quick access to WhatsApp and phone call for QuickRepair.",
  "frontend/src/components/Footer.tsx": "Responsive footer with QuickRepair branding, contact details, smooth-scroll quick links, a services price list, copyright notice, and a caffeine.ai attribution.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with animated gradient background, floating brand heading, tagline, trust badges, and CTA buttons for viewing services or booking via WhatsApp.",
  "frontend/src/components/InAppChat.tsx": "Empty file placeholder for the in-app chat component.",
  "frontend/src/components/LiveTracking.tsx": "Empty file placeholder for the live tracking component.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with smooth-scroll links, a slide-in mobile menu, scroll-aware background, and a WhatsApp deep-link for mechanic registration.",
  "frontend/src/components/OtpFlow.tsx": "Empty file with no content.",
  "frontend/src/components/PaymentPage.tsx": "Empty file with no content.",
  "frontend/src/components/ProviderProfile.tsx": "Empty file with no content.",
  "frontend/src/components/ProviderRegistrationForm.tsx": "Empty file with no content.",
  "frontend/src/components/ProvidersSection.tsx": "Empty file with no content.",
  "frontend/src/components/RatingReview.tsx": "Empty file with no content.",
  "frontend/src/components/ReferEarn.tsx": "Empty file with no content.",
  "frontend/src/components/ScheduleBooking.tsx": "Empty file with no content.",
  "frontend/src/components/Services.tsx": "Displays a grid of five fixed-price home services (plumber, electrician, etc.) where clicking a card opens a pre-filled WhatsApp booking message, plus a general WhatsApp CTA button.",
  "frontend/src/components/SuccessModal.tsx": "Empty file with no content.",
  "frontend/src/contexts/LanguageContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using an anonymous actor when unauthenticated and an identity-bound actor when logged in, invalidating dependent queries on actor change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/clear functions and status flags via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file that exports nothing, noting that no backend queries are needed for this frontend-only application.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for the brand palette, Tailwind utility aliases, and custom animations (hero gradient, card fade-in, WhatsApp pulse button, etc.).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with brand colors (navy, orange, yellow), custom shadows, border radii, and named keyframe animations matching the global CSS.",
  "project_state.json": "Tracks the current state of the QuickRepair single-page website project (version 13), including business details, service prices, architectural notes, and a list of implemented features. Serves as the source of truth for build planning and feature history."
}