{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (rebrand, navbar, hero, services, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of every frontend source file describing their purpose, key features, and notable implementation details.",
  "frontend/index.css": "Base Tailwind CSS file defining CSS custom property tokens for light and dark themes (colors, borders, charts, sidebar) used by shadcn-ui components.",
  "frontend/index.html": "HTML entry point with QuickRepair page title and meta description for Mahipalpur home services, mounting the React app at #root.",
  "frontend/src/App.tsx": "Root React component that composes the full page layout by rendering Navbar, Hero, Services, AboutUs, ContactUs, Footer, and FloatingButtons in order.",
  "frontend/src/components/AboutUs.tsx": "About section displaying four feature cards (Verified Mechanics, 10 Min Guarantee, Cash on Delivery, No Hidden Charges) and a stats bar with customer/mechanic counts.",
  "frontend/src/components/BookingForm.tsx": "Empty file placeholder for the booking form component.",
  "frontend/src/components/BookingHistory.tsx": "Empty file placeholder for the booking history component.",
  "frontend/src/components/ContactUs.tsx": "Contact section with clickable cards for phone, email, working hours, and WhatsApp, plus a service areas grid listing six coverage zones.",
  "frontend/src/components/EmergencySOS.tsx": "Empty file placeholder for the Emergency SOS component.",
  "frontend/src/components/FloatingButtons.tsx": "Fixed bottom-right floating action buttons providing quick access to WhatsApp (wa.me/8447978940) and phone call (tel:8447978940).",
  "frontend/src/components/Footer.tsx": "Responsive footer with QuickRepair branding, contact details, quick navigation links, a services price list, and copyright/attribution text.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section for QuickRepair Mahipalpur with animated gradient background, CTA buttons for viewing services and WhatsApp booking, trust badges, and a scroll indicator.",
  "frontend/src/components/InAppChat.tsx": "Empty file with no implementation.",
  "frontend/src/components/LiveTracking.tsx": "Empty file with no implementation.",
  "frontend/src/components/Navbar.tsx": "Fixed responsive navbar with scroll-aware styling, smooth-scroll nav links, a slide-in mobile menu with overlay, and a 'Become Mechanic' WhatsApp CTA button.",
  "frontend/src/components/OtpFlow.tsx": "Empty file with no implementation.",
  "frontend/src/components/PaymentPage.tsx": "Empty file with no implementation.",
  "frontend/src/components/ProviderProfile.tsx": "Empty file with no implementation.",
  "frontend/src/components/ProviderRegistrationForm.tsx": "Empty file with no implementation.",
  "frontend/src/components/ProvidersSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/RatingReview.tsx": "Empty file with no implementation.",
  "frontend/src/components/ReferEarn.tsx": "Empty file with no implementation.",
  "frontend/src/components/ScheduleBooking.tsx": "Empty file with no implementation.",
  "frontend/src/components/Services.tsx": "Displays a grid of five fixed-price service cards (plumber, electrician, etc.) that open a pre-filled WhatsApp booking message on click, plus a general WhatsApp CTA button.",
  "frontend/src/components/SuccessModal.tsx": "Empty file with no implementation.",
  "frontend/src/contexts/LanguageContext.tsx": "Empty file with no implementation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using an anonymous actor when unauthenticated and an identity-bound actor when logged in, invalidating dependent queries on actor change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for ICP Internet Identity authentication, managing AuthClient lifecycle, login/logout, and exposing identity and login status via React context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file that exports nothing, noting that no backend queries are needed for this frontend-only application.",
  "frontend/src/index.css": "Global stylesheet importing Poppins font and Tailwind, defining CSS custom properties for brand colors, and declaring utility classes and keyframe animations for hero, service cards, and WhatsApp button effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with brand colors (navy, orange, yellow), custom border radii, box shadows, and named animations/keyframes matching the app's design system.",
  "project_state.json": "Tracks the current state of the QuickRepair single-page website project (version 11), including business details, service prices, features implemented, architectural notes, and known issues. Serves as the source of truth for build planning and feature history."
}