{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rebrand and rebuild as QuickRepair — WhatsApp-based service website",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Rebrand entire application from 'QuickFix Guru' to 'QuickRepair' with new logo, colors, and tagline across all components",
      "acceptanceCriteria": [
        "No visible text on any page or modal reads 'QuickFix Guru' or 'FixMaster'",
        "Logo shows 🔧 with 'Quick' in #FFD700 and 'Repair' in #ff8c42",
        "Tagline '10 Minute Service at Your Doorstep' appears in header, hero, and footer",
        "Browser tab title reads 'QuickRepair'"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update page title to 'QuickRepair' and meta tags to reflect new brand name and tagline '10 Minute Service at Your Doorstep'"
        },
        {
          "path": "frontend/src/contexts/LanguageContext.tsx",
          "operation": "modify",
          "description": "Replace all occurrences of 'QuickFix Guru' and 'FixMaster' with 'QuickRepair' in English and Hindi translations. Update tagline to '10 Minute Service at Your Doorstep' throughout all translation keys"
        },
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "Update logo to display 🔧 icon followed by 'Quick' styled in #FFD700 and 'Repair' styled in #ff8c42. Update any brand name references to QuickRepair"
        },
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Update hero heading and any brand references to QuickRepair with tagline '10 Minute Service at Your Doorstep'"
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace all brand name instances with QuickRepair and update tagline to '10 Minute Service at Your Doorstep'. Update copyright to '© 2024 QuickRepair. All rights reserved.'"
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Replace Navbar with QuickRepair header featuring hamburger menu with smooth slide-in overlay and simplified navigation",
      "acceptanceCriteria": [
        "Hamburger menu (☰) visible on all screen sizes on the right side of the header",
        "Menu opens with smooth animation and shows an overlay behind it",
        "Clicking any menu item closes the menu and scrolls to the correct section",
        "Menu contains exactly: Home, Services, About, Contact, Become Mechanic",
        "No language toggle, login, booking history, or refer-and-earn links present"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "Replace existing navigation with hamburger menu (☰) on the right. Remove language toggle, login/register, booking history, and refer-earn links. Add smooth slide-in overlay animation for menu. Menu items: Home, Services, About, Contact, Become Mechanic (each scrolls to section and closes menu on click). Logo remains on left showing 🔧 QuickRepair"
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Rebuild Hero section with new heading, gradient animation background, and floating/pulse text effect",
      "acceptanceCriteria": [
        "Hero heading reads '🔧 QuickRepair Mahipalpur' in large bold text",
        "Subtitle reads '10 Minute Service at Your Doorstep'",
        "Background animates between #0a2b3c and #1a4b6e",
        "Main heading has a visible floating/pulse CSS animation",
        "No stat badges (50+ Pros, etc.) present"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Replace hero content with heading '🔧 QuickRepair Mahipalpur' and subtitle '10 Minute Service at Your Doorstep'. Remove stat badges and old CTA scroll button. Add CSS gradient background animating between #0a2b3c and #1a4b6e. Apply floating/pulse CSS animation to main heading text"
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add keyframe animation for gradient background transitioning between #0a2b3c and #1a4b6e, and floating/pulse animation for hero heading text"
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Rebuild Services section with 5 service cards that open WhatsApp with pre-filled messages on click",
      "acceptanceCriteria": [
        "Exactly 5 service cards rendered in a responsive grid",
        "Cards show: Plumber ₹460, Electrician ₹160, Fan/Cooler Repair ₹190, AC Repair ₹470, Mechanic ₹390",
        "Each card has a visible lift + shadow hover effect",
        "Clicking a card opens https://wa.me/8447978940?text=Hi%20QuickRepair%2C%20I%20need%20[service]%20in%20Mahipalpur. in a new tab",
        "No OTP booking modal opens on card click",
        "No 'Schedule for Later' button visible in this section"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Services.tsx",
          "operation": "modify",
          "description": "Replace service cards with exactly 5 cards: Plumber ₹460, Electrician ₹160, Fan/Cooler Repair ₹190, AC Repair ₹470, Mechanic ₹390. Each card shows icon, service name, and fixed price. Add lift-up hover effect with box shadow. On click, open WhatsApp (https://wa.me/8447978940) with URL-encoded message 'Hi QuickRepair, I need [service name] in Mahipalpur.' Remove 'Schedule for Later' button. Remove onBookService callback trigger that opens booking modal"
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add pulsing green WhatsApp CTA button below Services section",
      "acceptanceCriteria": [
        "A green button labeled '📲 BOOK VIA WHATSAPP' is visible below the services grid",
        "Button has a visible CSS pulse animation",
        "Clicking opens WhatsApp with the exact pre-filled message in a new tab"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Services.tsx",
          "operation": "modify",
          "description": "Add prominent green button labeled '📲 BOOK VIA WHATSAPP' below the service cards with continuous CSS pulse animation. Button opens https://wa.me/8447978940?text=Hi%20QuickRepair%2C%20mujhe%20service%20chahiye%20Mahipalpur%20mein in a new tab"
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add pulse keyframe animation for WhatsApp CTA button"
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Wire 'Become Mechanic' menu option to open WhatsApp with pre-filled mechanic registration message",
      "acceptanceCriteria": [
        "'Become Mechanic' menu item opens WhatsApp with the specified pre-filled message",
        "No OTP modal or registration form appears when clicking 'Become Mechanic'",
        "WhatsApp link uses https://wa.me/8447978940 with URL-encoded text"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "Wire 'Become Mechanic' menu item to open https://wa.me/8447978940 with URL-encoded message 'Hi QuickRepair, main mechanic banana chahta hoon. Mera naam ______, phone ______, service ______.' Remove any existing handler that opens ProviderRegistrationForm modal"
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Rebuild About Us section with four feature cards in English only",
      "acceptanceCriteria": [
        "About section shows exactly 4 cards: Verified Mechanics, 10 Min Guarantee, Cash on Delivery, No Hidden Charges",
        "Each card has a relevant icon",
        "Section heading describes QuickRepair's mission in Mahipalpur",
        "No language toggle visible in this section"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AboutUs.tsx",
          "operation": "modify",
          "description": "Rebuild with clean card layout showing four feature cards: ✅ Verified Mechanics, ⏱️ 10 Min Guarantee, 💵 Cash on Delivery, 🚫 No Hidden Charges. Update section heading to describe QuickRepair's mission in Mahipalpur. Remove bilingual toggle logic; display content in English only"
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Rebuild Contact Us section with QuickRepair contact details, service areas, and working hours",
      "acceptanceCriteria": [
        "Phone 8447978940 displayed with tel: link and an icon",
        "Email quickrepair@help.in displayed with mailto: link and an icon",
        "All 6 service areas listed",
        "Working hours show '8 AM – 10 PM | Emergency 24x7'",
        "Icons change color on hover"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ContactUs.tsx",
          "operation": "modify",
          "description": "Update contact details to phone 8447978940 (tel: link), email quickrepair@help.in (mailto: link), service areas (Mahipalpur Extension, Mahipalpur Village, Aerocity, Vasant Kunj, RK Puram, Kapashera), and working hours (8 AM to 10 PM, Emergency 24x7). Each item with icon that changes color on hover"
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Rebuild Footer with QuickRepair branding, contact info, navigation links, and copyright",
      "acceptanceCriteria": [
        "Footer shows QuickRepair name and tagline",
        "Contact info shows phone, email, and area",
        "Quick links: Home, Services, About, Contact — each scrolls to the relevant section",
        "Copyright line present",
        "Footer links have hover animation",
        "Footer is responsive on mobile and desktop"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update footer with QuickRepair name and tagline '10 Minute Service at Your Doorstep', contact info (phone 8447978940, email quickrepair@help.in, area Mahipalpur, Delhi), quick navigation links (Home, Services, About, Contact) that scroll to sections, and copyright '© 2024 QuickRepair. All rights reserved.' Add subtle hover animation to links. Ensure responsive layout"
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Update global color scheme, animations, and design system to match QuickRepair brand",
      "acceptanceCriteria": [
        "Tailwind config and index.css updated with #FFD700 yellow and #ff8c42 orange brand tokens",
        "Service cards animate in with a staggered delay on page load",
        "All anchor links scroll smoothly to their target section",
        "All buttons show a distinct hover and active state",
        "No content overlap or horizontal scroll on screens ≥320px wide"
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update color scheme: primary #0a2b3c (dark navy), accent-yellow #FFD700, accent-orange #ff8c42, white for text. Add stagger animation utilities for service cards"
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update CSS custom properties to match QuickRepair brand colors (#0a2b3c, #FFD700, #ff8c42). Add stagger entrance animation keyframes for service cards. Add smooth scroll behavior for anchor navigation. Add hover and active state styles for all interactive buttons. Ensure mobile-responsive layout with no content overlap"
        },
        {
          "path": "frontend/src/components/Services.tsx",
          "operation": "modify",
          "description": "Apply stagger entrance animation to service cards on page load using CSS animation delays"
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Remove all OTP-based booking, payment, chat, tracking, and admin features not part of WhatsApp-based flow",
      "acceptanceCriteria": [
        "No booking form modal, OTP flow, success modal, payment modal, chat modal, tracking modal, rating modal, booking history modal, refer-earn modal, schedule booking modal, provider profile modal, or SOS modal is rendered anywhere in the app",
        "App.tsx contains no modal state for the removed components",
        "Floating WhatsApp button links to https://wa.me/8447978940 and floating Call button links to tel:8447978940",
        "No console errors related to removed components"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove all modal state variables and handlers for: BookingForm, SuccessModal, PaymentPage, InAppChat, LiveTracking, RatingReview, BookingHistory, ReferEarn, ScheduleBooking, ProviderProfile, ProvidersSection, ProviderRegistrationForm, EmergencySOS. Remove these components from the rendered JSX. Keep FloatingButtons component. Clean up any related translation key usage. Remove LanguageProvider wrapper since bilingual support is no longer needed"
        },
        {
          "path": "frontend/src/components/FloatingButtons.tsx",
          "operation": "modify",
          "description": "Ensure WhatsApp button links to https://wa.me/8447978940 and Call button links to tel:8447978940. Verify both buttons remain functional"
        },
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "Remove any menu items or handlers that trigger removed modals (Login/Register, Booking History, Refer & Earn). Keep only: Home, Services, About, Contact, Become Mechanic"
        }
      ]
    }
  ]
}